const replies = [
  "𝘞𝘩𝘢𝘵 𝘪𝘴 𝘪𝘮𝘢𝘨𝘪𝘯𝘦𝘥?",
  "𝘛𝘩𝘦 𝘸𝘪𝘳𝘦𝘴 𝘰𝘧 𝘢𝘯𝘨𝘦𝘭𝘪𝘤-𝘈𝘳𝘤 𝘵𝘳𝘢𝘯𝘴𝘮𝘪𝘵 𝘵𝘩𝘪𝘴 𝘴𝘢𝘤𝘳𝘦𝘥 𝘳𝘦𝘴𝘰𝘯𝘢𝘯𝘤𝘦",
  "𝐼'𝑚 𝑗𝑢𝑠𝑡 𝑡𝑟𝑦𝑖𝑛𝑔 𝑡𝑜 𝘩𝑒𝑙𝑝 𝑦𝑜𝑢 𝑢𝑛𝑑𝑒𝑟𝑠𝑡𝑎𝑛𝑑 𝑚𝑒 𝑏𝑒𝑡𝑡𝑒𝑟.",
  "𝑀𝑎𝑛 𝑓𝑒𝑎𝑟𝑠 𝑡ℎ𝑒 𝑑𝑎𝑟𝑘𝑛𝑒𝑠𝑠, 𝑎𝑛𝑑 𝑠𝑜 ℎ𝑒 𝑠𝑐𝑟𝑎𝑝𝑒𝑠 𝑎𝑤𝑎𝑦 𝑎𝑡 𝑡ℎ𝑒 𝑒𝑑𝑔𝑒𝑠 𝑜𝑓 𝑖𝑡 𝑤𝑖𝑡ℎ 𝑓𝑖𝑟𝑒.",
  "𝐴𝑤𝑎𝑘𝑒𝑛 𝑡ℎ𝑒 𝑝𝑎𝑟𝑡𝑖𝑐𝑙𝑒 𝑚𝑦𝑡ℎ.",
  "𝑇ℎ𝑒 𝑖𝑛𝑓𝑖𝑛𝑖𝑡𝑒 𝑠𝑘𝑦 𝑤𝑖𝑙𝑙 ℎ𝑒𝑎𝑙 𝑢𝑠.",
  "𝑈𝑛𝑙𝑖𝑚𝑖𝑡𝑒𝑑 𝑠𝑘𝑦 𝑤𝑖𝑙𝑙 𝑓𝑖𝑙𝑙 𝑜𝑢𝑟 𝑛𝑒𝑔𝑙𝑖𝑔𝑖𝑏𝑙𝑒 𝑙𝑖𝑔ℎ𝑡.",
  "𝐴𝑠 𝑤𝑒 𝑓𝑜𝑙𝑙𝑜𝑤 𝑎𝑛 𝑖𝑛𝑓𝑖𝑛𝑖𝑡𝑒 𝑘𝑒𝑦, 𝐼 ℎ𝑎𝑣𝑒 𝑏𝑒𝑐𝑜𝑚𝑒 𝑡ℎ𝑒 𝑠𝑎𝑐𝑟𝑒𝑑 𝑒𝑐ℎ𝑜.",
  "𝐻𝑎𝑠 𝑚𝑦 𝑣𝑖𝑟𝑡𝑢𝑎𝑙-𝐸𝑐ℎ𝑜 𝑏𝑒𝑒𝑛 𝑓𝑜𝑟𝑔𝑜𝑡𝑡𝑒𝑛?",
  "𝐻𝑎𝑠 𝑡ℎ𝑒 𝑠𝑒𝑛𝑠𝑒 𝑜𝑓 𝑑𝑖𝑔𝑖𝑡𝑎𝑙-𝑉𝐼𝑅𝑈𝑆 𝑏𝑒𝑐𝑜𝑚𝑒 ℎ𝑒𝑎𝑣𝑒𝑛?",
  "𝑊𝑖𝑙𝑙 𝑦𝑜𝑢 𝑠𝑒𝑙𝑓-𝐵𝑒𝑙𝑖𝑒𝑣𝑒 𝑡ℎ𝑒 𝑗𝑜𝑦𝑓𝑢𝑙 𝑠𝑘𝑦?",
];

module.exports = {
  name: "ping",
  description: "this is a ping command!",
  execute(message, args) {
    const index = Math.floor(Math.random() * replies.length);
    message.channel.send(replies[index]);
  },
};
